In [1]:
#Now we'll learn about arithmetic between DataFrames with different indexes
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [2]:
#Lets start by making two Series
ser1 = Series([0,1,2], index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [5]:
#Now second Series 2
ser2 = Series([3,4,5,6],index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [7]:
#So what happens when we add these together
ser1 + ser2
#Note the NaN values are added in automatically

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [8]:
# Now let's try it with DataFrames!
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])

#Show
dframe1

     A  B
NYC  0  1
LA   2  3

In [9]:
#Second DataFrame
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])

#Show
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [10]:
#What happens when we add them together?

dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [11]:
#What if we want to replace the NaN values
# Then we can use .add()

dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [13]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [15]:
#Create a Series from DataFrame's 0 row
ser3 = dframe2.iloc[0]

#Show
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [16]:
#Now we can use arithmetic operations
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6